app/Livewire/Partials/Footer.php

select * from `categories` where `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null
---
    public function mount(){
        $this->categories = Category::all();
        $this->brands = Brand::all();