app/Livewire/Partials/Navbar.php

    public function mount(){
        // telt alle items in de cart op maar ook de quantity van een item
        $this->total_count = array_sum(array_column(CartManagement::getCartItemsFromSession(), 'quantity'));

        // Haal de free_shipping_threshold uit de database (één record in settings)
        $setting = Setting::first();
---
select * from `settings` limit 1