routes/web.php

    Route::get('/cancel', CancelPage::class)->name('cancel');
    Route::get('/wishlist', WishlistPage::class)->name('wishlist');

    Route::get('/my-orders/{order_id}/invoice', function ($order_id) {
        $order = Order::with('items.product', 'user', 'address')->findOrFail($order_id);

        // Je mag alleen je eigen orders zien
        if ($order->user_id !== auth()->id()) {
            abort(403);
        }

        // Barry VDB DOM PDF
        $pdf = \Barryvdh\DomPDF\Facade\Pdf::loadView('pdf.invoice', [
            'order' => $order
        ]);

        // Download factuur van dit order
        return $pdf->download('invoice-order-' . $order->id . '.pdf');
    })->name('my-orders.invoice');
---
select * from `addresses` where `addresses`.`id` in (1) and `addresses`.`deleted_at` is null
select * from `orders` where `orders`.`id` = '13' and `orders`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null