app/Filament/Resources/ReviewResource/Pages/ManageReviewsWithStats.php

    public function refreshPendingCount(): void
    {
        $this->pendingReviewCount = Review::where('approved', false)->count();
---
select count(*) as aggregate from `reviews` where `approved` = 0 and `reviews`.`deleted_at` is null