app/Livewire/Components/DrawerCartModal.php

select * from `products` where `products`.`id` = 3 and `products`.`deleted_at` is null limit 1
---
    public function mount(){
        // haal items op uit de sessie
        $this->cart_items = CartManagement::getCartItemsFromSession();

        // MAX VOORAAD VAN DEZE KLEUR OPSLAAN
        // &$item = zodat we rechtstreeks in de array schrijven
        foreach ($this->cart_items as &$item) {
            // PRODUCT OPHALEN VIA PRODUCT_ID
            $product = Product::find($item['product_id']);

select * from `products` where `products`.`id` = 1 and `products`.`deleted_at` is null limit 1
---
    public function refreshCart()
    {
        $this->cart_items = CartManagement::getCartItemsFromSession(); // haal items op uit de sessie

        // MAX VOORAAD VAN DEZE KLEUR OPSLAAN
        // &$item = zodat we rechtstreeks in de array schrijven
        foreach ($this->cart_items as &$item) {
            $product = Product::find($item['product_id']);