app/Livewire/Pages/Blog/Index.php

select * from `blogs` where `blogs`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select * from `users` where `users`.`id` in (1, 2, 6) and `users`.`deleted_at` is null
select `categories`.*, `blog_category`.`blog_id` as `pivot_blog_id`, `blog_category`.`category_id` as `pivot_category_id` from `categories` inner join `blog_category` on `categories`.`id` = `blog_category`.`category_id` where `blog_category`.`blog_id` in (1, 2, 3, 4, 5) and `categories`.`deleted_at` is null
select count(*) as aggregate from `blogs` where `blogs`.`deleted_at` is null
---
    public function render()
    {
        // haal alle blogs op en sorteer volgens de datum
        $blogs = Blog::with(['categories', 'user'])->orderByDesc('created_at')->paginate(6);