app/Livewire/Pages/Blog/Show.php

    public function mount($slug)
    {
        // haal de blog op volgens de slug
        $this->blog = Blog::with(['categories', 'user'])->where('slug', $slug)->firstOrFail();

        // Zoek vorige en vorige blog op basis van created_at
        $this->prevBlog = Blog::where('created_at', '<', $this->blog->created_at)
            ->whereNull('deleted_at') // Zoek alleen actieve blogs (sluit softdeleted uit)
            ->orderBy('created_at', 'desc') // sorteer op created_at om de vorige blog te vinden
            ->first(); // eerstvolgende blog

        // Zoek vorige en volgende blog op basis van created_at
        $this->nextBlog = Blog::where('created_at', '>', $this->blog->created_at)
            ->whereNull('deleted_at') // Zoek alleen actieve blogs (sluit softdeleted uit)
            ->orderBy('created_at', 'asc') // sorteer op created_at om de vorige blog te vinden
            ->first(); // eerstvolgende blog

        $this->latestBlog = Blog::where('id', '!=', $this->blog->id)
            ->whereNull('deleted_at') // Zoek alleen actieve blogs (sluit softdeleted uit)
            ->latest('created_at')
            ->take(5) // haal de laatste 4 blogs
            ->get(); // haal alle blogs
---
select * from `blogs` where `slug` = 'pure-is-the-most-furniture' and `blogs`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null
select `categories`.*, `blog_category`.`blog_id` as `pivot_blog_id`, `blog_category`.`category_id` as `pivot_category_id` from `categories` inner join `blog_category` on `categories`.`id` = `blog_category`.`category_id` where `blog_category`.`blog_id` in (1) and `categories`.`deleted_at` is null
select * from `blogs` where `created_at` < '2025-06-20 15:00:35' and `deleted_at` is null and `blogs`.`deleted_at` is null order by `created_at` desc limit 1
select * from `blogs` where `created_at` > '2025-06-20 15:00:35' and `deleted_at` is null and `blogs`.`deleted_at` is null order by `created_at` asc limit 1
select * from `blogs` where `id` != 1 and `deleted_at` is null and `blogs`.`deleted_at` is null order by `created_at` desc limit 5