app/Helpers/CartManagement.php

select `id`, `name`, `price`, `images`, `slug`, `shipping_cost` from `products` where `products`.`id` = 2 and `products`.`deleted_at` is null limit 1
select * from `colors` where `colors`.`id` = 6 and `colors`.`deleted_at` is null limit 1
---
    static public function addItemToCartWithQuantity(int $product_id, int $quantity, ?int $color_id = null): int
    {
        // QUANTITY NOOIT ONDER 1
        if ($quantity < 1) {
            $quantity = 1;
        }

        $cart_items = self::getCartItemsFromSession();
        $existing_item = null;

        foreach($cart_items as $key => $item){
            if(
                $item['product_id'] == $product_id
                && ($item['color_id'] ?? null) === $color_id
            ){
                $existing_item = $key;
                break;
            }
        }

        if ($existing_item !== null) {
            // Voeg toe aan de bestaande hoeveelheid
            $cart_items[$existing_item]['quantity'] += $quantity;
            $cart_items[$existing_item]['total_amount'] = $cart_items[$existing_item]['quantity'] *
                $cart_items[$existing_item]['unit_amount'];
        } else {
            $product = Product::find($product_id, ['id', 'name', 'price', 'images', 'slug', 'shipping_cost']);
            $color = $color_id ? Color::find($color_id) : null;

select * from `settings` limit 1
---
    public static function calculateShippingAmount(array $cart_items): float
    {
        // 1) Bereken sub_total zodat we kunnen checken op gratis verzending
        $grand_total = self::calculateGrandTotal($cart_items);

        // 2) Haal threshold op uit de instellingen
        $setting   = Setting::first();