app/Helpers/CartManagement.php

    public static function calculateShippingAmount(array $cart_items): float
    {
        // 1. Eerst alles optellen, zodat je weet of je gratis verzending hebt
        $grand_total = self::calculateGrandTotal($cart_items);

        // 2. Haal gratis-verzending-threshold uit settings
        $setting   = Setting::first();
---
select * from `settings` limit 1