app/Filament/Widgets/DashboardStats.php

select count(*) as aggregate from `reviews` where `approved` = 0 and `reviews`.`deleted_at` is null
select count(*) as aggregate from `product_color_stocks` where `stock` = 0
select count(*) as aggregate from `product_color_stocks` where `stock` between 1 and 9
---
    protected function getStats(): array
    {
        // Reviews die nog niet goedgekeurd zijn
        $pendingReviews = Review::where('approved', false)->count();

        // Totaal aantal uitverkochte kleurcombinaties
        $outOfStock = ProductColorStock::where('stock', 0)->count();

        // Kleurcombinaties met lage voorraad (tussen 1 en 9)
        $lowStock = ProductColorStock::whereBetween('stock', [1, 9])->count();