app/Filament/Resources/OrderResource/Widgets/OrderStats.php

    protected function getStats(): array
    {
        return [
            // NEW ORDERS
            Stat::make('New Orders', Order::query()->where('status', 'new')->count())
                ->description('Orders waiting to be handled')
                ->descriptionIcon('heroicon-o-clock')
                ->color('warning'),

            // PROCESSING
            Stat::make('Order Processing', Order::query()->where('status', 'processing')->count())
                ->description('Orders in processing')
                ->descriptionIcon('heroicon-o-arrow-path')
                ->color('info'),

            // SHIPPED
            Stat::make('Order Shipped', Order::query()->where('status', 'shipped')->count())
                ->description('Orders sent to customers')
                ->descriptionIcon('heroicon-o-truck')
                ->color('success'),


            // GEMIDDELDE PRIJS
            Stat::make('Average Price',
                Number::currency(
                    Order::query()->avg('grand_total') ?? 0, 'EUR'))
                ->description('Average value per order')
                ->descriptionIcon('heroicon-o-currency-euro')
                ->color('gray'),
---
select count(*) as aggregate from `orders` where `status` = 'processing'
select count(*) as aggregate from `orders` where `status` = 'processing' and `orders`.`deleted_at` is null
select avg(`grand_total`) as aggregate from `orders` where `orders`.`deleted_at` is null