app/Livewire/CartPage.php

select * from `products` where `products`.`id` = 1 and `products`.`deleted_at` is null limit 1
---
    protected function loadCart(): void
    {
        // 1) Haal alle items uit de cart uit de sessie
        $this->cart_items  = CartManagement::getCartItemsFromSession();

        // 2) Voeg bij elk item het maximum voorraad toe, afhankelijk van gekozen kleur
        foreach ($this->cart_items as &$item) {
            $product = Product::find($item['product_id']); // zoek product op via id