app/Livewire/CheckoutPage.php

select * from `settings` limit 1
select * from `addresses` where `addresses`.`user_id` = 6 and `addresses`.`user_id` is not null and `addresses`.`deleted_at` is null
---
    public function mount()
    {
        $cart_items = CartManagement::getCartItemsFromSession();
        if(count($cart_items) == 0){
            return redirect('/products');
        }

        $setting = Setting::first();
        $this->free_shipping_threshold = $setting->free_shipping_threshold ?? 0;

        $this->sub_total = CartManagement::calculateGrandTotal($cart_items);
        $this->calculateShippingAmount($cart_items);

        $user = auth()->user();
        if ($user) {
            $this->addresses = $user->addresses; // Haal alle adressen van de user op
            // Optioneel: auto-selecteer het laatst gebruikte adres
            if ($this->addresses->count()) {
                $this->selected_address_id = $this->addresses->first()->id;

insert into `addresses` (`user_id`, `first_name`, `last_name`, `phone`, `street_address`, `city`, `state`, `zip_code`, `updated_at`, `created_at`) values (13, 'Sven', 'zefzef', '5648756565', 'ebve51', 'Izegem', 'West-Vlaanderen (nl)', '8870', '2025-06-17 18:30:38', '2025-06-17 18:30:38')
---
    public function placeOrder()
    {
        $user = auth()->user();

        // 1. Valideer invoer afhankelijk van adreskeuze
        $rules = [
            'payment_method' => 'required',
        ];
        if ($this->selected_address_id == 'new' || !$this->addresses || !$this->addresses->count()) {
            $rules = array_merge($rules, [
                'first_name'      => 'required',
                'last_name'       => 'required',
                'phone'           => 'required',
                'street_address'  => 'required',
                'city'            => 'required',
                'state'           => 'required',
                'zip_code'        => 'required',
            ]);
        }
        $this->validate($rules);

        // 2. Bepaal het adres-id
        if ($this->selected_address_id && $this->selected_address_id !== 'new') {
            // Bestaand adres gekozen
            $address_id = $this->selected_address_id;
        } else {
            // Nieuw adres aanmaken
            $address = Address::create([
                'user_id'        => $user ? $user->id : null,
                'first_name'     => $this->first_name,
                'last_name'      => $this->last_name,
                'phone'          => $this->phone,
                'street_address' => $this->street_address,
                'city'           => $this->city,
                'state'          => $this->state,
                'zip_code'       => $this->zip_code,
            ]);

insert into `orders` (`user_id`, `address_id`, `sub_total`, `grand_total`, `payment_method`, `payment_status`, `status`, `currency`, `shipping_amount`, `shipping_method`, `notes`, `updated_at`, `created_at`) values (13, 8, 199.99, 264.99, 'cod', 'pending', 'new', 'EUR', 65, 'Truck Delivery', 'Order placed by sven', '2025-06-17 18:30:38', '2025-06-17 18:30:38')
select * from `product_color_stocks` where `product_id` = 1 and `color_id` = 1 limit 1
update `product_color_stocks` set `stock` = `stock` - 1, `product_color_stocks`.`updated_at` = '2025-06-17 18:30:38' where `id` = 1
---
    private function createOrder($cart_items, $address_id)
    {
        $user = auth()->user();
        $order = new Order();
        $order->user_id = $user ? $user->id : null;
        $order->address_id = $address_id;
        $order->sub_total = $this->sub_total;
        $order->grand_total = $this->sub_total + $this->shipping_amount;
        $order->payment_method = $this->payment_method;
        $order->payment_status = $this->payment_method == 'cod' ? 'pending' : 'paid';
        $order->status = 'new';
        $order->currency = 'EUR';
        $order->shipping_amount = $this->shipping_amount;
        $order->shipping_method = 'Flat Rate';
        $order->notes = 'Order placed by ' . ($user ? $user->name : 'guest');
        $order->save();

        // Sla order items op
        $order->items()->createMany($cart_items);

        // Verlaag stock
        foreach ($cart_items as $item) {
            $stockEntry = ProductColorStock::where('product_id', $item['product_id'])
                ->where('color_id', $item['color_id'])
                ->first();

            if ($stockEntry) {
                $stockEntry->decrement('stock', $item['quantity']);