app/Livewire/HomePage.php

    public function mount(){
        // Haal de free_shipping_threshold uit de database (één record in settings)
        $setting = Setting::first();
        $this->free_shipping_threshold = $setting->free_shipping_threshold ?? 0.0;

        $this->blogs = Blog::latest()->take(8)->get();
---
select * from `blogs` where `blogs`.`deleted_at` is null order by `created_at` desc limit 8