app/Livewire/HomePage.php

    public function render()
    {
        // als de brand actief is geven we hem weer (is_active staat in de brand model)
        $brands = Brand::where('is_active', 1)->get();
        $categories = Category::where('is_active', 1)->get();
---
select * from `brands` where `is_active` = 1
select * from `categories` where `is_active` = 1