app/Livewire/HomePage.php

select * from `settings` limit 1
---
    public function mount(){
        // Haal de free_shipping_threshold uit de database (één record in settings)
        $setting = Setting::first();

select * from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null
select * from `categories` where `is_active` = 1 and `categories`.`deleted_at` is null
select * from `products` where `is_active` = 1 and `is_featured` = 1 limit 8
---
    public function render()
    {
        // als de brand actief is geven we hem weer (is_active staat in de brand model)
        $brands = Brand::where('is_active', 1)->get();
        $categories = Category::where('is_active', 1)->get();

        // haal alleen de actieve, featured producten op (max. 8)
        $featuredProducts = Product::query()
            ->where('is_active', 1)
            ->where('is_featured', 1)
            ->take(8)
            ->get();