app/Livewire/MyOrderDetailPage.php

select * from `addresses` where `addresses`.`id` in (1) and `addresses`.`deleted_at` is null
select * from `orders` where `orders`.`id` = '13' and `orders`.`deleted_at` is null limit 1
select * from `colors` where `colors`.`id` in (5) and `colors`.`deleted_at` is null
select * from `order_items` where `order_id` = '13'
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
---
    public function render()
    {
        // Haal de order zelf op (inclusief gekoppeld adres)
        $order = Order::with('address')->find($this->order_id);

        // Haal alle items van deze order op (inclusief product en kleur info)
        $order_items = OrderItem::with(['product', 'color'])->where('order_id', $this->order_id)->get();