app/Livewire/MyOrdersPage.php

select * from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null
---
    public function render()
    {
        // Haal de orders van de ingelogde user op (nieuwste eerst, max 6 per pagina)
        $my_orders = Order::where('user_id', auth()->user()->id)->latest()->paginate(6);