app/Livewire/ProductsPage.php

    public function addToCart($product_id){

        // KLEUR ADD TO CART

        // HAAL GESELECTEERD KLEUR OP
        $selectedColorId = $this->selectedColorPerProduct[$product_id] ?? null;


        // Als er geen kleur geselecteerd is, voeg een foutmelding toe
        if (!$selectedColorId) {

            $this->addError("selectedColorPerProduct.$product_id", 'Please select a color first.');
            return;
        }

        // CONTROLLEER NIET OVER MAX STOCK GAAN

        // Haal het product op met alle kleuren
        $product = Product::with('productColorStocks')->findOrFail($product_id);
---
select * from `product_color_stocks` where `product_color_stocks`.`product_id` in (2)
select * from `products` where `products`.`id` = 2 and `products`.`deleted_at` is null limit 1

    public function render()
    {
        // Start een query om alleen actieve producten op te halen en hun stock quantity
        $productQuery = Product::with(['colors', 'productColorStocks'])
            ->where('is_active', 1);

        // Filter de producten op basis van de geselecteerde categorieën, als er categorieën zijn geselecteerd
        if(!empty($this->selected_categories)) {
            $productQuery->whereIn('category_id', $this->selected_categories);
        }

        // Selected COLORS filter
        if (!empty($this->selected_colors)) {
---
select * from `colors`

        // TEL de producten op basis van de geselecteerde categorieën
        $totalFilteredCount = (clone $productQuery)->count();

        return view('livewire.products-page', [
            'products' => $productQuery->paginate(6),
            'brands' => Brand::where('is_active', 1)->get(['id', 'name', 'slug']),
            'categories' => Category::where('is_active', 1)->get(['id', 'name', 'slug']),
            'colors' => Color::all(),
            'filtered_count' => $totalFilteredCount,
        ]);
---
select * from `products` where `is_active` = 1 and `products`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select `id`, `name`, `slug` from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null
select count(*) as aggregate from `products` where `is_active` = 1 and `products`.`deleted_at` is null
select `id`, `name`, `slug` from `categories` where `is_active` = 1 and `categories`.`deleted_at` is null
select * from `colors` where `colors`.`deleted_at` is null