app/Livewire/ProductsPage.php

        // Filter de producten op basis van de geselecteerde categorieën, als er categorieën zijn geselecteerd
        $totalFilteredCount = (clone $productQuery)->count();

        return view('livewire.products-page', [
            'products' => $productQuery->paginate(6),
            'brands' => Brand::where('is_active', 1)->get(['id', 'name', 'slug']),
            'categories' => Category::where('is_active', 1)->get(['id', 'name', 'slug']),
            'colors' => Color::all(),
            'filtered_count' => $totalFilteredCount,
        ]);
---
select * from `products` where `is_active` = 1 order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `products` where `is_active` = 1
select `id`, `name`, `slug` from `brands` where `is_active` = 1
select `id`, `name`, `slug` from `categories` where `is_active` = 1