app/Livewire/ProductDetailPage.php

    public function mount($slug)
    {
        $this->product = Product::with(['colors', 'productColorStocks'])
            ->where('slug', $slug)
            ->firstOrFail();
---
select * from `product_color_stocks` where `product_color_stocks`.`product_id` in (2)
select * from `products` where `slug` = 'urbancraft-coffee-table' and `products`.`deleted_at` is null limit 1
select `colors`.*, `color_product`.`product_id` as `pivot_product_id`, `color_product`.`color_id` as `pivot_color_id` from `colors` inner join `color_product` on `colors`.`id` = `color_product`.`color_id` where `color_product`.`product_id` in (2) and `colors`.`deleted_at` is null

    public function render()
    {
        logger()->info('Livewire debug', [
            'selectedColorId' => $this->selectedColorId,
            'quantity' => $this->quantity,
            'maxStock' => $this->maxStock,
        ]);

        // haal alleen de actieve, featured producten op (max. 8)
        $featuredProducts = Product::query()
            ->where('is_active', 1)
            ->where('is_featured', 1)
            ->take(8)
            ->get();
---
select * from `products` where `is_active` = 1 and `is_featured` = 1 and `products`.`deleted_at` is null limit 8