app/Livewire/ProductReviewList.php

select * from `reviews` where `reviews`.`product_id` = 11 and `reviews`.`product_id` is not null and `approved` = 1 and `reviews`.`deleted_at` is null order by `created_at` desc
select * from `users` where `users`.`id` in (8, 9) and `users`.`deleted_at` is null
---
    public function render()
    {
        // LIJST APPROVED REVIEWS
        return view('livewire.product-review-list', [
            'reviews' => $this->product->reviews()->where('approved', true)->latest()->with('user')->get(),
        ]);