app/Livewire/ProductRatingPage.php

select avg(`rating`) as aggregate from `reviews` where `reviews`.`product_id` = 1 and `reviews`.`product_id` is not null and `approved` = 1 and `reviews`.`deleted_at` is null
select count(*) as aggregate from `reviews` where `reviews`.`product_id` = 1 and `reviews`.`product_id` is not null and `approved` = 1 and `reviews`.`deleted_at` is null
---
    public function render()
    {
        $average = round($this->product->reviews()->where('approved', true)->avg('rating'), 1);
        $total = $this->product->reviews()->where('approved', true)->count();