app/Livewire/ProductReviewForm.php

    public function hasUserReviewed(): bool
    {
        return $this->product
            ->reviews()
            ->where('user_id', Auth::id())
            ->exists();
---
select exists(select * from `reviews` where `reviews`.`product_id` = 5 and `reviews`.`product_id` is not null and `user_id` = 6 and `reviews`.`deleted_at` is null) as `exists`