app/Livewire/ProfileAddresses.php

    public function refreshAddresses() {
        $this->addresses = Auth::user()->addresses()->latest()->get();
---
select * from `addresses` where `addresses`.`user_id` = 6 and `addresses`.`user_id` is not null and `addresses`.`deleted_at` is null order by `created_at` desc

    public function edit($id) {
        $adr = Address::where('user_id', Auth::id())->findOrFail($id);
---
select * from `addresses` where `addresses`.`user_id` = 7 and `addresses`.`user_id` is not null and `addresses`.`deleted_at` is null order by `created_at` desc

    public function save() {
        $this->validate([
            'first_name' => 'required',
            'last_name'  => 'required',
            'street_address' => 'required',
            'city' => 'required',
            'state' => 'required',
            'zip_code' => 'required',
        ]);

        $data = [
            'user_id' => Auth::id(),
            'first_name' => $this->first_name,
            'last_name'  => $this->last_name,
            'phone' => $this->phone,
            'street_address' => $this->street_address,
            'city' => $this->city,
            'state' => $this->state,
            'zip_code' => $this->zip_code,
        ];

        if ($this->edit_id) {
            Address::where('user_id', Auth::id())->findOrFail($this->edit_id)->update($data);
        } else {
            Address::create($data);
---
insert into `addresses` (`user_id`, `first_name`, `last_name`, `phone`, `street_address`, `city`, `state`, `zip_code`, `updated_at`, `created_at`) values (23, 'Jan ', 'Dorie', '01629629595', 'Roeselarestraat 65', 'Roeselare', 'West-Vlaanderen', '8800', '2025-06-27 07:09:52', '2025-06-27 07:09:52')