app/Livewire/SuccessPage.php

select * from `addresses` where `addresses`.`id` in (2) and `addresses`.`deleted_at` is null
select * from `orders` where `user_id` = 6 and `orders`.`deleted_at` is null order by `created_at` desc limit 1
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null
---
    private function handleStripeSuccess()
    {
        // Controleer of er pending order data in de sessie staat
        $pending_order_data = session()->get('pending_order_data');
        if (!$pending_order_data) {
            // Geen pending data, probeer laatste order op te halen
            return Order::with('address', 'user')
                ->where('user_id', auth()->user()->id)
                ->latest()
                ->first();

insert into `orders` (`user_id`, `address_id`, `sub_total`, `grand_total`, `payment_method`, `payment_status`, `status`, `currency`, `shipping_amount`, `shipping_method`, `notes`, `transaction_id`, `updated_at`, `created_at`) values (6, '1', 199.99, 264.99, 'stripe', 'paid', 'new', 'EUR', 65, 'Flat Rate', 'Order placed by Didier Vanassche', 'pi_3RafdtQsPaPro7IJ1nqmGrcw', '2025-06-16 16:12:21', '2025-06-16 16:12:21')
select * from `product_color_stocks` where `product_id` = 1 and `color_id` = 1 limit 1
update `product_color_stocks` set `stock` = `stock` - 1, `product_color_stocks`.`updated_at` = '2025-06-16 16:12:21' where `id` = 1
---
    private function createOrderFromPendingData($pending_order_data, $session_info)
    {
        $cart_items = $pending_order_data['cart_items'];
        $address_id = $pending_order_data['address_id']; // ADRES ID UIT DE SESSIE!

        $order = new Order();
        $order->user_id = auth()->user()->id;
        $order->address_id = $address_id; // HIER KOPPEL IK HET JUISTE ADRES
        $order->sub_total = $pending_order_data['sub_total'];
        $order->grand_total = $pending_order_data['sub_total'] + $pending_order_data['shipping_amount'];
        $order->payment_method = 'bancontact';
        $order->payment_status = 'paid';
        $order->status = 'new';
        $order->currency = 'EUR';
        $order->shipping_amount = $pending_order_data['shipping_amount'];
        $order->shipping_method = 'Truck Delivery';
        $order->notes = 'Order placed by ' . auth()->user()->name;
        $order->transaction_id = $session_info->payment_intent;
        $order->save();

        // Sla order items op
        $order->items()->createMany($cart_items);

        // Verlaag stock
        foreach ($cart_items as $item) {
            $stockEntry = ProductColorStock::where('product_id', $item['product_id'])
                ->where('color_id', $item['color_id'])
                ->first();

            if ($stockEntry) {
                $stockEntry->decrement('stock', $item['quantity']);

select * from `addresses` where `addresses`.`id` in (1) and `addresses`.`deleted_at` is null
select * from `orders` where `orders`.`id` = 2 and `orders`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (6) and `users`.`deleted_at` is null
---
        Mail::to($order->user->email)->send(new InvoicePaidMail($order));

        // Herlaad order met relaties voor de view
        return Order::with('address', 'user')->find($order->id);