app/Livewire/WishlistButton.php

    public function mount(Product $product)
    {
        $this->isInWishlist = auth()->check()
            && auth()->user()
                ->wishlist()
                ->where('product_id', $product->id)
                ->exists();
---
select exists(select * from `wishlists` where `wishlists`.`user_id` = 6 and `wishlists`.`user_id` is not null and `product_id` = 1) as `exists`