app/Livewire/WishlistCountIcon.php

select count(*) as aggregate from `wishlists` where `user_id` = 6
---
    public function mount(){
        // Tel wishlist-items voor deze gebruiker
        // Neem id van ingelogde user en zoek in de wishlist-tabel waar de kolom user_id gelijk is aan de ingelogde gebruiker.
        if(auth()->check()){
            $this->count = Wishlist::where('user_id', auth()->user()->id)->count();