app/Filament/Resources/ProductColorStockResource.php

    public static function getNavigationBadge(): ?string
    {
        $outOfStock = ProductColorStock::where('stock', 0)->count();
        $lowStock = ProductColorStock::whereBetween('stock', [1, 9])->count();
---
select count(*) as aggregate from `product_color_stocks` where `stock` = 0
select count(*) as aggregate from `product_color_stocks` where `stock` between 1 and 9