app/Filament/Resources/ReviewResource.php

    public static function getNavigationBadge(): ?string
    {
        $count = Review::where('approved', false)->count();
---
select count(*) as aggregate from `reviews` where `approved` = 0 and `reviews`.`deleted_at` is null