app/Mail/InvoiceMail.php

    public function __construct(Order $order)
    {
        // Sla het order op als property
        $this->order = $order;

        // kleur en product laden
        $this->order = $order->load('items.color', 'items.product', 'user');
---
select * from `colors` where `colors`.`id` in (1) and `colors`.`deleted_at` is null
select * from `products` where `products`.`id` in (1) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (13) and `users`.`deleted_at` is null