app/Mail/OrderPlacedMail.php

select * from `colors` where `colors`.`id` in (6) and `colors`.`deleted_at` is null
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (7) and `users`.`deleted_at` is null
---
    public function __construct(Order $order)
    {
        $this->order = $order;

        // kleur en product laden
        $this->order = $order->load('items.color', 'items.product', 'user');