app/Models/Product.php

    public function stockForColorId($colorId): int
    {
        return $this->productColorStocks()
            ->where('color_id', $colorId)
            ->value('stock') ?? 0;
---
select * from `product_color_stocks` where `product_color_stocks`.`product_id` = 1 and `product_color_stocks`.`product_id` is not null