app/Models/User.php

select exists(select * from `orders` where `orders`.`user_id` = 7 and `orders`.`user_id` is not null and exists (select * from `order_items` where `orders`.`id` = `order_items`.`order_id` and `product_id` = 3) and `payment_status` in ('pending', 'paid') and `orders`.`deleted_at` is null) as `exists`
---
    public function hasPurchasedProduct($productId)
    {
        return $this->orders()
            ->whereHas('items', function ($query) use ($productId) {
                $query->where('product_id', $productId);
            })
            ->whereIn('payment_status', ['pending', 'paid'])
            ->exists();