app/Livewire/Auth/RegisterPage.php

    public function save(){
        $this->validate([
            'name' => 'required|max:255',
            'email' => 'required|email|unique:users|max:255',
            'password' => 'required|min:6|max:255|confirmed',
            'password_confirmation' => 'required|min:6|max:255'
        ]);

        //save to database
        $user = User::create([
            'password' => Hash::make($this->password),
            'email' => $this->email,
            'name' => $this->name,
        ]);
---
insert into `users` (`password`, `email`, `name`, `updated_at`, `created_at`) values ('$2y$12$GMy33L6CnGbuvSLO7Cy/qOjE7rwjtAecyF8nj/oTr27sTl33HbPYm', 'bie@gmail.com', 'bie', '2025-06-16 19:22:19', '2025-06-16 19:22:19')